# Google sheet with personal questions

https://docs.google.com/spreadsheets/d/1kH6AfE3Iu6kdgQsDQvEGXaAkKlhAT6VaxeFOlJpnC0E/edit?usp=sharing

Every column corresponds to a single question, every row to a single student.

For example, R. Daneel Olivaw need to report questions 1.1, 1.2, 2.2, 2.3, etc.

# Submiting the answers


Google form to submit your answers: https://docs.google.com/forms/d/e/1FAIpQLSd2gNxCq9j8ZE_NzZlV8Q-gTNbiic5Rkx3vitz7vMlfzkzAzQ/viewform?usp=sf_link

Google form has fields for all questions, but you only need to answer **your** questions (from google sheet above).

Use your **skoltech email**. For Name, Surname use **exactly the same spelling** as in canvas system.

---

Every question has an information about the type of the answer, e.g.

> Observe top 10 observations (int)

here your answer must be a single **integer** number.

---

If your answer is a ``float number``, then it must be provided with **3 decimals after the floating point**, e.g. 1.234

---

If your answer is a ``list of float or integer numbers or str``, then they should be reported in descending (alphabetical) order, without spacing, divided by a comma, e.g.:

10.453,9.112,5.001,5.000 - Right

10.453, 9.112, 5.001, 5.000 - WRONG

---

Part of the tasks, e.g. Q19.1-5, Q20.1-5 do not have corresponding fields in the google form. They are **not optional** and they will be graded manually from your .ipynb file.

---

If you have any questions regarding this Home Assignment, ask them piazza topic: https://piazza.com/class/kespugtqfrn12g?cid=12

# Assignment 1. House Pricing.
by Anvar Kurmukov

---

By the end of this task you will be able to manipulate huge tabular data:
1. Compute different column's statistics (min, max, mean, quantiles etc.);
2. Select observations/features by condition/index;
3. Create new non-linear combinations of the columns (feature engineering);
4. Perform automated data cleaning;

and more.

---

For those who are not familiar with `pandas` we recommend these (alternative) tutorials:

1. Single notebook, covers basic pandas functionality (starting with renaming columns ending with using map, apply etc) ~ 30 short examples with links on videos https://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/pandas.ipynb . Highly recommended for everyone. (about 1-3 hours to go through)

2. https://github.com/guipsamora/pandas_exercises/ 11 topics covering all essential functionality with excersises (with solutions).

This task will be an easy ride after these tutorials.

---

We are using house sale price data from King County, Wahington, USA. This dataset is in public domain and can be obtained from Kaggle: https://www.kaggle.com/harlfoxem/housesalesprediction

You need to place `kc_nouse_data.csv` file in the same directory as this notebook.

In [1]:
import pandas as pd

# 1. Loading data

As always in Data Science you are starting with making nice cup of tea (or coffee). Your next move is to load the data:

- Start with loading `house_data.csv` file using `pd.read_csv()` function.
- You may also want to increase maximal displayed pandas columns: set `pd.options.display.max_columns` to 30
- Print top 10 observations in the table. `.head()`
- Print last 10 observations in the table. `.tail()`
- Print all the data columns names using method `.columns`
- Print data size (number of rows and columns). This is the `.shape` of the data.

*Almost* every python has a `head` and a `tail` just as DataFrames do.

In [2]:
# Load the data

In [3]:
data = pd.read_csv('kc_house_data.csv')

In [4]:
# Observe top 10 observations (int)

# Q1.1 What is the price of a house with `id` == 7237550310?
# Q1.2 How many bedrooms has a house with `id` == 7237550310?
# Q1.3 When was the house with `id` == 2414600126 built (`yr_built`)?
# Q1.4 What is the `grade` of a house with `id` == 5631500400?
# Q1.5 When was the house with `id` == 6414100192 renovated (`yr_renovated`)?

In [5]:
data.head(10)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
5,7237550310,20140512T000000,1225000.0,4,4.50,5420,101930,1.0,0,0,...,11,3890,1530,2001,0,98053,47.6561,-122.005,4760,101930
6,1321400060,20140627T000000,257500.0,3,2.25,1715,6819,2.0,0,0,...,7,1715,0,1995,0,98003,47.3097,-122.327,2238,6819
7,2008000270,20150115T000000,291850.0,3,1.50,1060,9711,1.0,0,0,...,7,1060,0,1963,0,98198,47.4095,-122.315,1650,9711
8,2414600126,20150415T000000,229500.0,3,1.00,1780,7470,1.0,0,0,...,7,1050,730,1960,0,98146,47.5123,-122.337,1780,8113
9,3793500160,20150312T000000,323000.0,3,2.50,1890,6560,2.0,0,0,...,7,1890,0,2003,0,98038,47.3684,-122.031,2390,7570

In [6]:
# Q1.4 What is the `grade` of a house with `id` == 5631500400?

In [7]:
d = data[data['id'] == 5631500400]
d[['id', 'grade']]

           id  grade
2  5631500400      6

In [8]:
# Q1.5 When was the house with `id` == 6414100192 renovated (`yr_renovated`)?

In [9]:
d = data[data['id'] == 6414100192]
d[['id', 'yr_renovated']]

           id  yr_renovated
1  6414100192          1991

In [10]:
# Observe last 10 observations (int)

# Q2.1 What is the price of a house with `id` == 263000018?
# Q2.2 How many bedrooms has a house with `id` == 291310100?
# Q2.3 When was the house with `id` == 1523300141 built (`yr_built`)?
# Q2.4 How many floors house with `id` == 2997800021 has?
# Q2.5 What is the zipcode of the house with `id` == 7852140040?

In [11]:
data.tail(10)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21603,7852140040,20140825T000000,507250.0,3,2.50,2270,5536,2.0,0,0,...,8,2270,0,2003,0,98065,47.5389,-121.881,2270,5731
21604,9834201367,20150126T000000,429000.0,3,2.00,1490,1126,3.0,0,0,...,8,1490,0,2014,0,98144,47.5699,-122.288,1400,1230
21605,3448900210,20141014T000000,610685.0,4,2.50,2520,6023,2.0,0,0,...,9,2520,0,2014,0,98056,47.5137,-122.167,2520,6023
21606,7936000429,20150326T000000,1007500.0,4,3.50,3510,7200,2.0,0,0,...,9,2600,910,2009,0,98136,47.5537,-122.398,2050,6200
21607,2997800021,20150219T000000,475000.0,3,2.50,1310,1294,2.0,0,0,...,8,1180,130,2008,0,98116,47.5773,-122.409,1330,1265
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

In [12]:
# Q2.3 When was the house with `id` == 1523300141 built (`yr_built`)?

In [13]:
d = data[data['id'] == 1523300141]
d[['id', 'yr_built']]

               id  yr_built
21610  1523300141      2009

In [14]:
# Q2.4 How many floors house with `id` == 2997800021 has?

In [15]:
d = data[data['id'] == 2997800021]
d[['id', 'floors']]

               id  floors
21607  2997800021     2.0

In [16]:
# Increase maximal displayed columns

In [17]:
pd.options.display.max_columns = 30

In [18]:
# Observe top 10 observations again
# Is there any new columns displayed? Answer: yes, we can see all 21 columns

In [19]:
data.head(10)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
5,7237550310,20140512T000000,1225000.0,4,4.50,5420,101930,1.0,0,0,3,11,3890,1530,2001,0,98053,47.6561,-122.005,4760,101930
6,1321400060,20140627T000000,257500.0,3,2.25,1715,6819,2.0,0,0,3,7,1715,0,1995,0,98003,47.3097,-122.327,2238,6819
7,2008000270,20150115T000000,291850.0,3,1.50,1060,9711,1.0,0,0,3,7,1060,0,1963,0,98198,47.4095,-122.315,1650,9711
8,2414600126,20150415T000000,229500.0,3,1.00,1780,7470,1.0,0,0,3,7,1050,730,1960,0,98146,47.5123,-122.337,1780,8113
9,3793500160,20150312T000000,323000.0,3,2.50,1890,6560,2.0,0,0,3,7,1890,0,2003,0,98038,47.3684,-122.031,2390,7570

In [20]:
# Print all the columns/features names (int)

# Q3.1 How many columns have `yr_` prefix?
# Q3.2 How many columns have `sqft_` prefix?
# Q3.3 How many columns assosiated with house earth coordinates are in the data?
# Q3.4 How many columns have `rooms` in their names?

In [21]:
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [22]:
# Q3.1 How many columns have `yr_` prefix?

In [23]:
data.loc[:, data.columns.str.startswith("yr_")].head()

   yr_built  yr_renovated
0      1955             0
1      1951          1991
2      1933             0
3      1965             0
4      1987             0

In [24]:
# Q3.2 How many columns have `sqft_` prefix?

In [25]:
data.loc[:, data.columns.str.startswith("sqft_")].head()

   sqft_living  sqft_lot  sqft_above  sqft_basement  sqft_living15  sqft_lot15
0         1180      5650        1180              0           1340        5650
1         2570      7242        2170            400           1690        7639
2          770     10000         770              0           2720        8062
3         1960      5000        1050            910           1360        5000
4         1680      8080        1680              0           1800        7503

In [26]:
# Print data size (int)

# Q4.1 How many observations are in the data? Answer: 21613
# Q4.2 How many features are in the data? Answer: 21

In [27]:
data.shape

(21613, 21)

# 2. Basic data exploration

Lets do some basics:
- `.count()` number of not NaN's in every column.
- Is there any missing values in the data?
- Count number of unique values in every column `.nunique()`. 
- What does this tells you about the features, which are most likely categorical and which are most likely numerical?
- Use pandas `.describe()` to display basic statistic about the data.
- Use pandas `.value_counts()` to count number of unique values in a specific column.
- Use pandas `.min()`, `.max()`, `.mean()`, `.std()` to display specific statistics about the data.
- Use pandas `.dtypes` field to display data types in columns.

**Hint**
You could use `.sort_index()` or `.sort_values()` to sort the result of `.value_counts()`

In [28]:
# Display number of not NaN's in every column (int)

# Q5.1 How many NA values are in the `floors` column?
# Q5.2 How many NA values are in the `grade` column?
# Q5.3 How many NA values are in the `bedrooms` column? Answer: 0
# Q5.4 How many NA values are in the `yr_built` column? Answer: 0
# Q5.5 How many NA values (not zeros, but empty, missing values) are in the `yr_renovated` column?

In [29]:
data[data.isna().any(axis=1)]

Empty DataFrame
Columns: [id, date, price, bedrooms, bathrooms, sqft_living, sqft_lot, floors, waterfront, view, condition, grade, sqft_above, sqft_basement, yr_built, yr_renovated, zipcode, lat, long, sqft_living15, sqft_lot15]
Index: []

In [30]:
data.count()

id               21613
date             21613
price            21613
bedrooms         21613
bathrooms        21613
sqft_living      21613
sqft_lot         21613
floors           21613
waterfront       21613
view             21613
condition        21613
grade            21613
sqft_above       21613
sqft_basement    21613
yr_built         21613
yr_renovated     21613
zipcode          21613
lat              21613
long             21613
sqft_living15    21613
sqft_lot15       21613
dtype: int64

In [31]:
# Count number of unique values in every column (int)

# Q6.1 How many unique values are in the `bedrooms` column?
# Q6.2 How many unique values are in the `grade` column?
# Q6.3 How many unique values are in the `yr_renovated` column?
# Q6.4 How many unique values are in the `bathrooms` column?
# Q6.5 How many unique values are in the `long` column?

In [32]:
data.nunique()

id               21436
date               372
price             4028
bedrooms            13
bathrooms           30
sqft_living       1038
sqft_lot          9782
floors               6
waterfront           2
view                 5
condition            5
grade               12
sqft_above         946
sqft_basement      306
yr_built           116
yr_renovated        70
zipcode             70
lat               5034
long               752
sqft_living15      777
sqft_lot15        8689
dtype: int64

In [33]:
# Q6.3 How many unique values are in the `yr_renovated` column?

In [34]:
data['yr_renovated'].nunique()

70

In [35]:
# Q6.4 How many unique values are in the `bathrooms` column?

In [36]:
data['bathrooms'].nunique()

30

In [37]:
# Count frequency of the values in different columns (list of ints in ascending order)
# You could select a column using same syntax as for selecting a key from a dictionary: `data[colname]`

# Q7.1 For every unique `floors` value give its number of occurences.
# Q7.2 For every unique `condition` value give its number of occurences.
# Q7.3 For every unique `bedrooms` value give its number of occurences.
# Q7.4 For every unique `grade` value give its number of occurences.
# Q7.5 For every unique `view` value give its number of occurences.

In [38]:
# Q7.1 For every unique `floors` value give its number of occurences. Answer: 10680,8241,1910,613,161,8

In [39]:
(data['floors'].value_counts()).sort_values()

3.5        8
2.5      161
3.0      613
1.5     1910
2.0     8241
1.0    10680
Name: floors, dtype: int64

In [40]:
# Q7.2 For every unique `condition` value give its number of occurences. Answer: 14031,5679,1701,172,30

In [41]:
(data['condition'].value_counts()).sort_values()

1       30
2      172
5     1701
4     5679
3    14031
Name: condition, dtype: int64

In [42]:
# Display basic data statistics using .describe()

In [43]:
data.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [44]:
# Display some column statistics (list of floats, rounded up to 3 digits, e.g. 1.234)

# Q8.1 What are the max, min, mean and the std of the `floors` column?
# Q8.2 What are the max, min, mean and the std of the `bedrooms` column?
# Q8.3 What are the max, min, mean and the std of the `sqft_living` column?
# Q8.4 What are the max, min, mean and the std of the `price` column?
# Q8.5 What are the max, min, mean and the std of the `long` column?

In [45]:
# Q8.2 What are the max, min, mean and the std of the `bedrooms` column? Answer: 33.000,3.371,0.930,0.000

In [46]:
data['bedrooms'].max()

33

In [47]:
data['bedrooms'].min()

0

In [48]:
round(data['bedrooms'].mean(), 3)

3.371

In [49]:
round(data['bedrooms'].std(), 3)

0.93

In [50]:
# Q8.5 What are the max, min, mean and the std of the `long` column? Answer: 0.141,-121.315,-122.214,-122.519

In [51]:
round(data['long'].max(), 3)

-121.315

In [52]:
round(data['long'].min(), 3)

-122.519

In [53]:
round(data['long'].mean(), 3)

-122.214

In [54]:
round(data['long'].std(), 3)

0.141

In [55]:
# Display data types of all columns (int)

# Q9.1 How many columns have `object` data type?
# Q9.2 How many columns have `int64` data type?
# Q9.3 How many columns have `float64` data type?

# Display data types of all columns (list of str)
# Q9.4 What are the columns with dtype == `float64`?
# Q9.5 What are the columns with dtype == `int64`?

In [56]:
data.dtypes

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

In [57]:
# Q9.3 How many columns have `float64` data type? Answer: 5

In [58]:
data.dtypes.value_counts()

int64      15
float64     5
object      1
dtype: int64

In [59]:
# Q9.4 What are the columns with dtype == `float64`? Answer: price,long,lat,floors,bathrooms

In [60]:
(data.dtypes[data.dtypes == 'float64']).sort_index()

bathrooms    float64
floors       float64
lat          float64
long         float64
price        float64
dtype: object

# 3. Data selection

In pandas.DataFrame you could select

1. Row/s by position (integer number \[0 .. number of rows - 1\]) `.iloc` or by DataFrame.index `.loc`:
```
data.loc[0]
data.loc[5:10]
data.iloc[0]
data.iloc[5:10]
```
*Though, this is probably the worst way to manipulate rows.*

2. Columns by name
```
data[columname]
```
3. Row/s and columns
```
data.loc[10, columname]
data.iloc[10, columnindex] 
```
4. Using boolean mask
```
mask = data[columname] > value
data[mask]
```
You could combine multiple conditions using `&` or `|` (and, or)

```
cond1 = data[columname1] > value1
cond2 = data[columname2] > value2
data[cond1 & cond2]
```
5. Using queries `.query()`:
```
value = 5
data.query("columname > value")
```
You could combine multiple conditions using `and`, `or`

```
data.query("(columname1 > value1) and (columname2 > value2)")
```
and others. See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html for more examples.

*Remember to use different quotation marks " or ' for columnname inside a query.*

In [61]:
# # setting DataFrame index to be an `id` column, now .loc and .iloc will have different behavior
# data.index = data.id

# # dropping `id` column, since now it is an index
# data.drop('id', axis=1, inplace=True)

# # sort data by index for clarity
# data.sort_index(inplace=True)

In [62]:
data.index = data.id

In [63]:
data.drop('id', axis=1, inplace=True) # if without inplace=True, that will be just copy and data won't change

In [64]:
data.sort_index(inplace=True)

In [65]:
# Select rows by position (int) 

# Q10.1 How many bedrooms have a house on row 777?
# Q10.2 When was built a house on row 9999?
# Q10.3 How many floors have a house on row 1337?
# Q10.4 How many bathrooms have a house on row 314?
# Q10.5 What is the grade of a house on row 2718?

In [66]:
# Q10.1 How many bedrooms have a house on row 777?

In [67]:
data.iloc[777 - 1].bedrooms

3

In [68]:
# Q10.3 How many floors have a house on row 1337?

In [69]:
data.iloc[1337 - 1].floors

2.0

In [70]:
# Select rows by index (int)

# Q11.1 How many times the house with index 1000102 were sold?
# Q11.2 What is the price of the house with index 9842300095?
# Q11.3 When was built the house with index 104510440?
# Q11.4 What is the condition of a house with index 252000300?
# Q11.5 What is the living area (in square feets) of the house with index 1225069038?

In [71]:
# Q11.3 When was built the house with index 104510440?

In [72]:
data.loc[104510440].yr_built

1984

In [73]:
# Q11.5 What is the living area (in square feets) of the house with index 1225069038?

In [74]:
data.loc[1225069038].sqft_living

13540

In [75]:
# Using mask or .query syntax select rows/columns (int)

# Q12.1 How many houses were built during American Great Depression (1929–1939)? Including both start and end year.
# Q12.2 When was built the only house with basement area = 1024 sqft?
# Q12.3 How many houses are with the highest possible grade?
# Q12.4 When was built a house with maximal number of bedrooms?
# Q12.5 How many houses were sold for 256000 dollars?

In [76]:
# Q12.2 When was built the only house with basement area = 1024 sqft? Answer: 2006

In [77]:
mask = data["sqft_basement"] == 1024
(data[mask]).yr_built

id
4136980090    2006
Name: yr_built, dtype: int64

In [78]:
# Q12.5 How many houses were sold for 256000 dollars? Answer: 8

In [79]:
mask = data["price"] == 256000
(data[mask]).shape

(8, 20)

In [80]:
# Using mask or .query syntax select rows/columns (int)

# Q13.1 How many houses with the waterfront (=1) were built duroing Nixon's presidency (1969—1974)? Including both start and end year.
# Q13.2 How many houses, built before first human in space (<1961), have high condition (=5)?
# Q13.3 How many houses are with 6 bedrooms and less than 2000 sqft living area?
# Q13.4 What was the price of a house with 5 bathrooms, built in 1998 and graded with 10 score?
# Q13.5 How many floors has a house built in 1999 with 5 bedrooms and 3400 sqft living area?

In [81]:
# Q13.3 How many houses are with 6 bedrooms and less than 2000 sqft living area? Answer: 20

In [82]:
cond1 = data["bedrooms"] == 6
cond2 = data["sqft_living"] < 2000
(data[cond1 & cond2]).shape

(20, 20)

In [83]:
# Q13.4 What was the price of a house with 5 bathrooms, built in 1998 and graded with 10 score?

In [84]:
cond1 = data["bathrooms"] == 5
cond2 = data["yr_built"] == 1998
cond3 = data["grade"] == 10
data[cond1 & cond2 & cond3].price

id
2322069010    1180000.0
Name: price, dtype: float64

In [85]:
# Using mask or .query syntax select rows/columns and compute simple statistics (float)

# Q14.1 What was the average (sold) price of a houses built in the year of Cuban Missile Crisis (1962)?
# Q14.2 What was the price of the most expensive house sold, built between 1991 and 2000?
# Q14.3 What was the price of the least expensive house sold, built between 1991 and 2000?
# Q14.4 What is the median number of bathrooms in houses with grade above 9 (10 and more)?
# Q14.5 What is the median grade of houses with most popular zipcode value?

In [86]:
# Q14.1 What was the average (sold) price of a houses built in the year of Cuban Missile Crisis (1962)?

In [87]:
mask = data["yr_built"] == 1962
round(data[mask].price.mean(), 3)

436715.314

In [88]:
# Q14.4 What is the median number of bathrooms in houses with grade above 9 (10 and more)?

In [89]:
mask = data['grade'] > 9
data[mask].bathrooms.median()

3.25

# 4. Creating new columns


Creating new column of pandas.DataFrame is as easy as:
```
data['new_awesome_column'] = [] 
```
that's it. But such a column is relatively useless. 
Typically, you would compute something new based on existing data and save it in a new column. 
For example one might want to compute total area of the house as a sum of all `sqft_` columns, or
create a boolean column of whether the house has `grade` > 2 or anything else:

```
data['total_area'] = data[col1] + data[col2] + ...
data['high_value'] = data[col] > 5
```

Pandas also provides another powerfull tool: `.apply`, `.map()`, `.applymap()` methods (they are kinda the same, but not quite). https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas .
They allow you to *apply* some function to every value in the column/s (row-wise) or row (column-wise) or cell (element-wise). For example, same computations of `total_area` and `high_value` using `.apply()`:
```
data['total_area'] = data[[col1, col2, col3]].apply(sum, axis=1)

```
you are not restricted to existent functions, `.apply()` accepts any function (including lambda functions):

```
data['total_area'] = data[[col1, col2, col3]].apply(lambda x: x[0]+x[1]+x[2], axis=1)
```
or ordinary python function (if this it should have complex behaviour):
```
def _sum(x):
    total = 0
    for elem in x:
        total += elem
    return total
    
data['total_area'] = data[[col1, col2, col3]].apply(_sum, axis=1) 
```
Many pandas methods has `axis` parameter `axis=0` refers to rows, `axis=1` refers to columns.

*Warning. You should never use for loops to sum numerical elements from the container.*

---

In [90]:
# Create `was_renovated` column. Bool column (0, 1) indicating whether the house was renovated.

In [91]:
data['was_renovated'] = (data['yr_renovated'] > 0).astype(int)

In [92]:
data[['was_renovated']]

            was_renovated
id
1000102                 0
1000102                 0
1200019                 0
1200021                 0
2800031                 0
...                   ...
9842300095              0
9842300485              0
9842300540              0
9895000040              0
9900000190              0

[21613 rows x 1 columns]

In [93]:
# Create new columns using the old ones (new column in your DataFrame)

# Q15.1 Create a `sqft_tot_area` column (sum of all columns with `sqft_` prefix) using any method above
# Q15.2 Create a new column `sqm_tot_area` using `sqft_tot_area` and the fact that 1 foot = 0.3048 meters
# Q15.3 Create a new column `sqm_aver_floor_area` by dividing total area (in meters) by number of floors
# Q15.4 Create a new column `price_cat` by splitting a `price` into 5 ([1..5]) distinct intervals: 0 < x <=20%,
# 20% < x <= 40%, ... 80% < x <= 100% percentiles. You could use `.quantile()` to compute percentiles.
# Q15.5 Create a new bool column `high_class` it is True if the house has grade >= 9 and condition >= 4

In [94]:
# Q15.1 Create a `sqft_tot_area` column (sum of all columns with `sqft_` prefix) using any method above

In [95]:
data.loc[:, data.columns.str.startswith("sqft_")].head()

,sqft_living,sqft_lot,sqft_above,sqft_basement,sqft_living15,sqft_lot15
id,,,,,,
1000102,2400,9373,2400,0,2060,7316
1000102,2400,9373,2400,0,2060,7316
1200019,2060,26036,1160,900,2590,21891
1200021,1460,43000,1460,0,2250,20023
2800031,1430,7599,1010,420,1290,10320

In [96]:
data['sqft_tot_area'] = data[['sqft_living', 'sqft_lot', 'sqft_above', 'sqft_basement', 'sqft_living15', 'sqft_lot15']].apply(sum, axis=1)

In [97]:
data[['sqft_tot_area']]

            sqft_tot_area
id
1000102             23549
1000102             23549
1200019             54637
1200021             68193
2800031             22069
...                   ...
9842300095          12726
9842300485          16532
9842300540          12376
9895000040           6453
9900000190          19840

[21613 rows x 1 columns]

In [98]:
# Q15.2 Create a new column `sqm_tot_area` using `sqft_tot_area` and the fact that 1 foot = 0.3048 meters

In [99]:
data['sqm_tot_area'] = data[['sqft_tot_area']].apply(lambda x: x[0] * 0.3048, axis=1)

In [100]:
data[['sqm_tot_area']]

            sqm_tot_area
id
1000102        7177.7352
1000102        7177.7352
1200019       16653.3576
1200021       20785.2264
2800031        6726.6312
...                  ...
9842300095     3878.8848
9842300485     5038.9536
9842300540     3772.2048
9895000040     1966.8744
9900000190     6047.2320

[21613 rows x 1 columns]

In [101]:
# Q15.3 Create a new column `sqm_aver_floor_area` by dividing total area (in meters) by number of floors

In [102]:
data['qm_aver_floor_area'] = data[['sqm_tot_area', 'floors']].apply(lambda x: x[0] / x[1], axis=1)

In [103]:
data[['qm_aver_floor_area']]

            qm_aver_floor_area
id
1000102              3588.8676
1000102              3588.8676
1200019             16653.3576
1200021             20785.2264
2800031              4484.4208
...                        ...
9842300095           2585.9232
9842300485           5038.9536
9842300540           3772.2048
9895000040           1311.2496
9900000190           6047.2320

[21613 rows x 1 columns]

In [104]:
# Q15.4 Create a new column `price_cat` by splitting a `price` into 5 ([1..5]) distinct intervals: 0 < x <=20%,
# 20% < x <= 40%, ... 80% < x <= 100% percentiles. You could use `.quantile()` to compute percentiles.

In [105]:
def price_quantile(x, data):
    if x <= data.quantile(0.2):
        total = 1
    elif data.quantile(0.2) < x <= data.quantile(0.4):
        total = 2
    elif data.quantile(0.4) < x <= data.quantile(0.6):
        total = 3
    elif data.quantile(0.6) < x <= data.quantile(0.8):
        total = 4
    elif data.quantile(0.8) < x <= data.quantile(1.):
        total = 5
            
    return total

In [106]:
data['price_cat'] = data['price'].apply(lambda x: price_quantile(x, data['price']))

In [107]:
data[['price_cat']]

            price_cat
id
1000102             2
1000102             1
1200019             4
1200021             3
2800031             1
...               ...
9842300095          2
9842300485          2
9842300540          2
9895000040          3
9900000190          1

[21613 rows x 1 columns]

In [108]:
# Q15.5 Create a new bool column `high_class` it is True if the house has grade >= 9 and condition >= 4

In [109]:
def high_class_quantile(grade, condition):
    if (grade >= 9 and condition >= 4):
        result = True
    else:
        result = False
    
    return result

In [110]:
data['high_class'] = data[['grade', 'condition']].apply(lambda x: high_class_quantile(x[0], x[1]), axis=1)

In [111]:
data[['grade', 'condition', 'high_class']]

            grade  condition  high_class
id
1000102         7          3       False
1000102         7          3       False
1200019         8          4       False
1200021         7          3       False
2800031         6          4       False
...           ...        ...         ...
9842300095      7          3       False
9842300485      7          5       False
9842300540      7          4       False
9895000040      9          3       False
9900000190      6          3       False

[21613 rows x 3 columns]

In [112]:
# Using mask or .query syntax select rows/columns (float)

# Q16.1 What is the average price of the house of the high_class(=True)?
# Q16.2 What is the average total_area (in meters) of the house from highest price category?
# Q16.3 What is the maximal number of floors amongst houses with the lowest price category?
# Q16.4 What is the most frequent zipcode amongst houses with the lowest price category?
# Q16.5 What is the minimal number of bathrooms in houses with high_class=True?

In [113]:
# Q16.3 What is the maximal number of floors amongst houses with the lowest price category? Answer: 3.000

In [114]:
d = data[data['price_cat'] == 1]
d[['floors']].max()

floors    3.0
dtype: float64

In [115]:
# Q16.5 What is the minimal number of bathrooms in houses with high_class=True? Answer: 1.000

In [116]:
d = data[data['high_class'] == True]
d[['bathrooms']].min()

bathrooms    1.0
dtype: float64

# 5. Basic date processing

You figure out that column `date` is to harsh for you, so you decided to convert it to a more plausible format:

- Use pandas method `to_datetime()` to convert the date to a good format.
- Exctract `year`, `month`, `day` and `weekday` from your new date column. Save them to separete columns.
- How many columns has your data now?
- Drop column `date`, remember to set `inplace` parameter to True.


**Hint** for datetime formatted date you could extract the `year` as follow:
```
data.date.dt.year
```

Very often date could be a ridiculously rich feature, sometimes it is holidays that matters, sometimes weekends, sometimes some special days like **black friday**. 

Learn how to work with date in Python!

In [117]:
# Create new columns based on `date` column

# Q17.1 Convert date to datetime format
# Q17.2 Extract and store `year`
# Q17.3 Extract and store `month`
# Q17.4 Extract and store `day`
# Q17.5 Extract and store `weekday`
# Q17.6 Create a new column `house_age_10` - the age of the house in full decades (e.g. 9 year old house - 0, 21 year old house - 2),
# using `yr_built` and 'year' columns

In [118]:
date = pd.to_datetime(data['date'])

In [119]:
data['date'] = date
data['year'] = data.date.dt.year
data['month'] = data.date.dt.month
data['day'] = data.date.dt.day
data['weekday'] = data.date.dt.weekday

In [120]:
def house_age_10_quantile(year, yr_built):
    if year - yr_built < 10:
        total = 0
    elif 10 <= year - yr_built < 20:
        total = 1
    elif 20 <= year - yr_built < 30:
        total = 2
    elif 30 <= year - yr_built < 40:
        total = 3
    elif 40 <= year - yr_built < 50:
        total = 4
    elif 50 <= year - yr_built < 60:
        total = 5
    elif 60 <= year - yr_built < 70:
        total = 6
    elif 70 <= year - yr_built < 80:
        total = 7
    elif 80 <= year - yr_built < 90:
        total = 8
    elif 90 <= year - yr_built < 100:
        total = 9
    elif 100 <= year - yr_built < 110:
        total = 10
    elif 110 <= year - yr_built:
        total = 11
            
    return total

In [121]:
data['house_age_10'] = data[['year', 'yr_built']].apply(lambda x:house_age_10_quantile(x[0], x[1]), axis=1)

In [122]:
data[['year', 'yr_built', 'house_age_10']]

            year  yr_built  house_age_10
id
1000102     2015      1991             2
1000102     2014      1991             2
1200019     2014      1947             6
1200021     2014      1952             6
2800031     2015      1930             8
...          ...       ...           ...
9842300095  2014      1927             8
9842300485  2015      1939             7
9842300540  2014      1942             7
9895000040  2014      2011             0
9900000190  2014      1943             7

[21613 rows x 3 columns]

In [123]:
# Drop column `date`

In [124]:
data.drop('date', axis=1, inplace=True)

In [125]:
# Find some date related information from the data (int, Sunday has index 0)

# Q18.1 What is the most popular selling weekday?
# Q18.2 What is the most popular selling month?
# Q18.3 What is the least popular selling weekday?
# Q18.4 What is the median age of the house (on a first available sold date)? (float)
# Q18.5 How many houses were sold on America's Independence Day (July, 4)?

In [126]:
# Q18.3 What is the least popular selling weekday? Answer: 6, Friday

In [127]:
(data['weekday'].value_counts()).sort_values()

6     230
5     287
4    3685
3    3994
0    4099
2    4603
1    4715
Name: weekday, dtype: int64

In [128]:
# Q18.4 What is the median age of the house (on a first available sold date)? (float) Answer: 39.000

In [129]:
data_duplicates = data[data.index.duplicated(False)]

In [130]:
data_duplicates = data_duplicates.reset_index()

In [131]:
removed_duplicates = data_duplicates.sort_values('year', ascending=True).drop_duplicates('id', keep='first').drop(columns='id')

In [132]:
data_without_duplicates = pd.concat([removed_duplicates, data[~data.index.duplicated(False)]])

In [133]:
(data_without_duplicates['year'] - data_without_duplicates['yr_built']).median()

39.0

In [134]:
data

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,was_renovated,sqft_tot_area,sqm_tot_area,qm_aver_floor_area,price_cat,high_class,year,month,day,weekday,house_age_10
id,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
1000102,300000.0,6,3.00,2400,9373,2.0,0,0,3,7,2400,0,1991,0,98002,47.3262,-122.214,2060,7316,0,23549,7177.7352,3588.8676,2,False,2015,4,22,2,2
1000102,280000.0,6,3.00,2400,9373,2.0,0,0,3,7,2400,0,1991,0,98002,47.3262,-122.214,2060,7316,0,23549,7177.7352,3588.8676,1,False,2014,9,16,1,2
1200019,647500.0,4,1.75,2060,26036,1.0,0,0,4,8,1160,900,1947,0,98166,47.4444,-122.351,2590,21891,0,54637,16653.3576,16653.3576,4,False,2014,5,8,3,6
1200021,400000.0,3,1.00,1460,43000,1.0,0,0,3,7,1460,0,1952,0,98166,47.4434,-122.347,2250,20023,0,68193,20785.2264,20785.2264,3,False,2014,8,11,0,6
2800031,235000.0,3,1.00,1430,7599,1.5,0,0,4,6,1010,420,1930,0,98168,47.4783,-122.265,1290,10320,0,22069,6726.6312,4484.4208,1,False,2015,4,1,2,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9842300095,365000.0,5,2.00,1600,4168,1.5,0,0,3,7,1600,0,1927,0,98126,47.5297,-122.381,1190,4168,0,12726,3878.8848,2585.9232,2,False,2014,7,25,4,8
9842300485,380000.0,2,1.00,1040,7372,1.0,0,0,5,7,840,200,1939,0,98126,47.5285,-122.378,1930,5150,0,16532,5038.9536,5038.9536,2,False,2015,3,11,2,7
9842300540,339000.0,3,1.00,1100,4128,1.0,0,0,4,7,720,380,1942,0,98126,47.5296,-122.379,1510,4538,0,12376,3772.2048,3772.2048,2,False,2014,6,24,1,7
9895000040,399900.0,2,1.75,1410,1005,1.5,0,0,3,9,900,510,2011,0,98027,47.5446,-122.018,1440,1188,0,6453,1966.8744,1311.2496,3,False,2014,7,3,3,0
9900000190,268950.0,3,1.00,1320,8100,1.0,0,0,3,6,880,440,1943,0,98166,47.4697,-122.351,1000,8100,0,19840,6047.2320,6047.2320,1,False,2014,10,30,3,7

# 6. Groupby
from the documentation https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

By “group by” we are referring to a process involving one or more of the following steps:

    - Splitting the data into groups based on some criteria.
    - Applying a function to each group independently.
    - Combining the results into a data structure.
    
---
`.groupby()` is one of the most powerfull tool for feature engineering. Very often it is used to group object with the same categorical characteristics and compute some statistics (e.g. mean, max, etc.) of a their numerical characteric. 

Instead of computing average area of houses with high grade you could compute average areas of the
houses for every grade in a single command:

```
data.groupby('grade')['sqm_tot_area'].mean()
```

You could also make multi-column groups:

```
data.groupby(['weekday','grade'])['price'].min()
```
next, you could compute multiple aggregation functions:
```
data.groupby(['weekday','grade'])['price'].agg([min, max])
```

instead of using built-in functions you could compute custom functions using apply:
```
import numpy as np
data.groupby(['condition','grade'])['bathrooms'].apply(lambda x: np.quantile(x, .5))
```

and the coolest thing now is that you can map the results of groupby back on your DataFrame!
```
gp = data.groupby(['condition'])['bathrooms'].median()
data['gp_feature'] = data['condition'].map(gp)
```
Now, if some house has `condition == 2`, its `gp_feature` will be equal to the median number of 
bathrooms amongst all houses with `condition == 2`.

Read more examples in the documentation https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

In [135]:
# Create some groupby features

# Q19.1 `price_by_class` groupby `high_class` and compute median `price`.
# Q19.2 `price_by_year` groupby `year` and compute median price.
# Q19.3 `price_by_weekday` groupby `weekday` and compute median price.
# Q19.4 `area_by_price` groupby `price_cat` and compute average `sqft_living`.
# Q19.5 `floors_by_age` groupby `floors` and compute average age of a house.

In [136]:
# Q19.1 `price_by_class` groupby `high_class` and compute median `price`.

In [137]:
pbc = data.groupby(['high_class'])['price'].median()
data['price_by_class'] = data['high_class'].map(pbc)

In [138]:
data[['high_class','price_by_class']].head(10)

         high_class  price_by_class
id
1000102       False        440000.0
1000102       False        440000.0
1200019       False        440000.0
1200021       False        440000.0
2800031       False        440000.0
3600057       False        440000.0
3600072       False        440000.0
3800008       False        440000.0
5200087       False        440000.0
6200017       False        440000.0

In [139]:
# Q19.3 `price_by_weekday` groupby `weekday` and compute median price.

In [140]:
pbw = data.groupby(['weekday'])['price'].median()
data['price_by_weekday'] = data['weekday'].map(pbw)

In [141]:
data[['weekday','price_by_weekday']]

            weekday  price_by_weekday
id
1000102           2          453000.0
1000102           1          449950.0
1200019           3          442500.0
1200021           0          453000.0
2800031           2          453000.0
...             ...               ...
9842300095        4          455000.0
9842300485        2          453000.0
9842300540        1          449950.0
9895000040        3          442500.0
9900000190        3          442500.0

[21613 rows x 2 columns]

In [142]:
# Create some other groupby features
# for this task check out this answer:
# https://stackoverflow.com/questions/47913343/how-to-groupby-and-map-by-two-columns-pandas-dataframe

# Q20.1 `n_houses_zipcode` groupby `zipcode` and count number of occurences of every unique zipcode
# Q20.2 `n_houses_yr_built` groupby `yr_built` and count number of houses built in each year
# Q20.3 `price_by_yr_month_`(median, std) groupby `year`, `month` and compute median and std `price`.
# Q20.4 `price_by_grade_age_`(median, std) groupby `grade`, `house_age` and compute median and std `price`.
# Q20.5 `living_by_cond_`(median, std) groupby `waterfront`, `view`, `condition` and compute median and std `sqft_living`.

In [143]:
# Q20.2 `n_houses_yr_built` groupby `yr_built` and count number of houses built in each year

In [144]:
data.groupby(['yr_built'])

data['n_houses_yr_built'] = data['yr_built'].map(data['yr_built'].value_counts())

In [145]:
data[['yr_built', 'n_houses_yr_built']]

            yr_built  n_houses_yr_built
id
1000102         1991                224
1000102         1991                224
1200019         1947                263
1200021         1952                220
2800031         1930                 90
...              ...                ...
9842300095      1927                115
9842300485      1939                106
9842300540      1942                223
9895000040      2011                130
9900000190      1943                170

[21613 rows x 2 columns]

In [146]:
# Q20.5 `living_by_cond_`(median, std) groupby `waterfront`, `view`, `condition` and compute median and std `sqft_living`.

In [147]:
m = data.groupby(['waterfront', 'view', 'condition'])['sqft_living'].median()
s = data.groupby(['waterfront', 'view', 'condition'])['sqft_living'].std()

In [148]:
m = m.reset_index(level=['waterfront', 'view', 'condition'])

In [149]:
s = s.reset_index(level=['waterfront', 'view', 'condition'])

In [150]:
p = pd.merge(m, s, on=['waterfront', 'view', 'condition'], how='left')

In [151]:
data = pd.merge(data, p, on=['waterfront', 'view', 'condition'], how='left')

In [152]:
data.rename(columns={'sqft_living_x':'living_by_cond_median', 'sqft_living_y': 'living_by_cond_std'}, inplace=True)

In [153]:
data['living_by_cond_std'].fillna(0, inplace=True)

In [154]:
data[['waterfront', 'view', 'condition', 'living_by_cond_median', 'living_by_cond_std']]

       waterfront  view  condition  living_by_cond_median  living_by_cond_std
0               0     0          3                 1910.0          875.297176
1               0     0          3                 1910.0          875.297176
2               0     0          4                 1760.0          730.099838
3               0     0          3                 1910.0          875.297176
4               0     0          4                 1760.0          730.099838
...           ...   ...        ...                    ...                 ...
21608           0     0          3                 1910.0          875.297176
21609           0     0          5                 1800.0          755.383338
21610           0     0          4                 1760.0          730.099838
21611           0     0          3                 1910.0          875.297176
21612           0     0          3                 1910.0          875.297176

[21613 rows x 5 columns]

In [155]:
# data['living_by_cond_'] = data['sqft_living_x'].astype(str) + ' , ' + data['sqft_living_y'].astype(str)

In [156]:
# data.drop('sqft_living_x', axis=1, inplace=True)

In [157]:
# data.drop('sqft_living_y', axis=1, inplace=True)

In [158]:
# data[['waterfront', 'view', 'condition', 'living_by_cond_']].head(10)

# 7. Building a regression model

> You do not need to normalize data for tree models, and for linear/knn models this step is essential.

> Remember, that not all of the features in the table are numeric, some of them might be viewed as categorical.

> You may create or drop **any** features you want, except for the features which use `price` (e.g. average price of a house with 5 bedrooms).

In [159]:
# Q21 Drop all generated features which used price column, e.g. price_by_year, price_cat.

In [160]:
data_wo_price = data.drop(data.loc[:, data.columns.str.startswith("price_")], axis=1, inplace=False)

In [161]:
# sqft_living - because we can calculate it based on 'sqft_above' and 'sqft_basement'
# yr_renovated - because we have more strong feature 'was_renovated'
# sqft_tot_area - because we can calculate it based on different features
# sqm_tot_area - because we can calculate it based on different features
# qm_aver_floor_area - because we can calculate it based on different features
# house_age_10 - because we can calculate it based on different features

In [162]:
data_wo_price = data_wo_price.drop(['sqft_living', 'yr_renovated', 'sqft_tot_area', 'sqm_tot_area', 'qm_aver_floor_area', 'house_age_10'], axis=1)

In [163]:
# Q22 Split your data into train and test parts.
# How many records (rows) do you have in train and test tables? (list of int)?
# Use sklearn.model_selection.train_test_split with test_size=0.33 and random_state=7

In [164]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

In [165]:
# Create a predictive regression model of a house price.

# Q23.1 Use linear regression with l2 regularization (Ridge regression)
# Q23.2 Use decision tree regression
# Q23.3 Use k nearest neighbours regression

In [166]:
# Q23.1 Use linear regression with l2 regularization (Ridge regression)

In [167]:
X = data_wo_price.drop('price', axis=1, inplace=False)
Y = data_wo_price[['price']]

In [168]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.33, random_state=7)

In [169]:
X_train.shape

(14480, 25)

In [170]:
X_test.shape

(7133, 25)

In [171]:
scaler = StandardScaler()

X_train = scaler.fit_transform(X_train)
X_test = scaler.fit_transform(X_test)

In [172]:
from sklearn.linear_model import Ridge
from sklearn.metrics import mean_squared_error, mean_absolute_error

In [173]:
clf = Ridge(alpha=1.0, normalize=False)

In [174]:
clf.fit(X_train, y_train)

Ridge()

In [175]:
clf.score(X_test, y_test)

0.7069629986096283

In [176]:
y_pred = clf.predict(X_test)

In [177]:
mean_squared_error(y_test, y_pred)

35465366287.17034

In [178]:
mean_absolute_error(y_test, y_pred)

124221.68181286534

In [179]:
overfitted_features = X.columns.tolist()
overfitted_weights = map(abs, clf.coef_[0].tolist())

pd.DataFrame({'features': overfitted_features, 'weights': overfitted_weights}).sort_values(by=['weights'], ascending=False)

                 features        weights
8              sqft_above  155890.587498
7                   grade  101624.989501
12                    lat   82780.825995
10               yr_built   82627.337492
9           sqft_basement   67137.115214
4              waterfront   50631.943674
0                bedrooms   36636.327673
1               bathrooms   36303.818561
11                zipcode   34868.739929
13                   long   30727.987189
24     living_by_cond_std   29366.656597
17             high_class   23113.788687
6               condition   22171.844421
18                   year   18913.266666
15             sqft_lot15   14094.014615
23  living_by_cond_median   13951.752610
14          sqft_living15   12708.171515
2                sqft_lot    9232.211794
5                    view    7784.697834
16          was_renovated    7607.457760
19                  month    5479.181392
20                    day    3692.888671
22      n_houses_yr_built    2380.184768
3                  floors    1902.652766
21                weekday     122.600991

In [180]:
# Q23.3 Use k nearest neighbours regression

In [181]:
from sklearn.neighbors import KNeighborsRegressor

In [182]:
neigh = KNeighborsRegressor(n_neighbors=5) # let's take model with default parameters

In [183]:
neigh.fit(X_train, y_train)

KNeighborsRegressor()

In [184]:
neigh.score(X_test, y_test)

0.726851362656997

In [185]:
y_pred_neigh = neigh.predict(X_test)

In [186]:
mean_squared_error(y_test, y_pred_neigh)

33058338804.477512

In [187]:
mean_absolute_error(y_test, y_pred_neigh)

104141.6925557269

In [188]:
# Use grid search to select optimal hyperparamters of your models. 

# Q24.1 Alpha for a ridge regression
# Q24.2 Depth for the tree
# Q24.3 Number of neighbours for the knn

In [189]:
# Q24.1 Alpha for a ridge regression

In [190]:
import numpy as np
from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import KFold

In [191]:
cv = KFold(n_splits=5, shuffle=True, random_state=7)

clf_gs = Ridge()

grid = {
    'alpha': np.logspace(-6,1,20)
}

ridge_gs = GridSearchCV(clf_gs, param_grid=grid, cv=cv)
ridge_gs.fit(X_train, y_train)

GridSearchCV(cv=KFold(n_splits=5, random_state=7, shuffle=True),
             estimator=Ridge(),
             param_grid={'alpha': array([1.00000000e-06, 2.33572147e-06, 5.45559478e-06, 1.27427499e-05,
       2.97635144e-05, 6.95192796e-05, 1.62377674e-04, 3.79269019e-04,
       8.85866790e-04, 2.06913808e-03, 4.83293024e-03, 1.12883789e-02,
       2.63665090e-02, 6.15848211e-02, 1.43844989e-01, 3.35981829e-01,
       7.84759970e-01, 1.83298071e+00, 4.28133240e+00, 1.00000000e+01])})

In [192]:
ridge_gs.cv_results_

{'mean_fit_time': array([0.0142302 , 0.01481209, 0.01152506, 0.01155858, 0.01251259,
        0.01177826, 0.01173968, 0.01150098, 0.01193137, 0.01090136,
        0.01236062, 0.01208181, 0.01219559, 0.00976372, 0.00876341,
        0.00885234, 0.00814915, 0.0091588 , 0.00950923, 0.01142349]),
 'std_fit_time': array([0.00420055, 0.00277188, 0.00158048, 0.00198988, 0.00071603,
        0.00082578, 0.0013463 , 0.00134386, 0.00200265, 0.00106519,
        0.00174583, 0.00269026, 0.0022542 , 0.00212153, 0.00103501,
        0.00073525, 0.0002414 , 0.00152268, 0.00112767, 0.00044536]),
 'mean_score_time': array([0.00412221, 0.00477276, 0.00379071, 0.00382242, 0.00373497,
        0.00404382, 0.00426688, 0.00378718, 0.00455275, 0.00287614,
        0.0041842 , 0.00363274, 0.00358348, 0.00358963, 0.00292821,
        0.00267105, 0.00253997, 0.0032351 , 0.00258656, 0.00369282]),
 'std_score_time': array([2.10946281e-04, 9.28906121e-04, 8.81442839e-04, 7.99966518e-04,
        6.68119557e-04, 9.26217658e-04, 1.58141737e-03, 2.04070071e-04,
        1.02275811e-03, 3.98228308e-04, 9.07323777e-04, 2.79089672e-04,
        6.06608750e-04, 1.38228824e-03, 5.60753208e-04, 2.42673781e-04,
        8.67522096e-05, 9.53443607e-04, 1.69697321e-04, 3.09328436e-04]),
 'param_alpha': masked_array(data=[1e-06, 2.335721469090121e-06, 5.455594781168514e-06,
                    1.274274985703132e-05, 2.9763514416313192e-05,
                    6.951927961775606e-05, 0.0001623776739188721,
                    0.000379269019073225, 0.0008858667904100823,
                    0.002069138081114788, 0.004832930238571752,
                    0.011288378916846883, 0.026366508987303555,
                    0.061584821106602544, 0.14384498882876628,
                    0.3359818286283781, 0.7847599703514607,
                    1.8329807108324339, 4.281332398719387, 10.0],
              mask=[False, False, False, False, False, False, False, False,
                    False, False, False, False, False, False, False, False,
                    False, False, False, False],
        fill_value='?',
             dtype=object),
 'params': [{'alpha': 1e-06},
  {'alpha': 2.335721469090121e-06},
  {'alpha': 5.455594781168514e-06},
  {'alpha': 1.274274985703132e-05},
  {'alpha': 2.9763514416313192e-05},
  {'alpha': 6.951927961775606e-05},
  {'alpha': 0.0001623776739188721},
  {'alpha': 0.000379269019073225},
  {'alpha': 0.0008858667904100823},
  {'alpha': 0.002069138081114788},
  {'alpha': 0.004832930238571752},
  {'alpha': 0.011288378916846883},
  {'alpha': 0.026366508987303555},
  {'alpha': 0.061584821106602544},
  {'alpha': 0.14384498882876628},
  {'alpha': 0.3359818286283781},
  {'alpha': 0.7847599703514607},
  {'alpha': 1.8329807108324339},
  {'alpha': 4.281332398719387},
  {'alpha': 10.0}],
 'split0_test_score': array([0.70685643, 0.70685643, 0.70685643, 0.70685643, 0.70685643,
        0.70685643, 0.70685643, 0.70685643, 0.70685643, 0.70685643,
        0.70685643, 0.70685643, 0.70685643, 0.70685644, 0.70685646,
        0.70685649, 0.70685658, 0.70685678, 0.70685718, 0.70685777]),
 'split1_test_score': array([0.70268095, 0.70268095, 0.70268095, 0.70268095, 0.70268095,
        0.70268095, 0.70268095, 0.70268095, 0.70268096, 0.70268097,
        0.702681  , 0.70268106, 0.7026812 , 0.70268154, 0.70268234,
        0.70268419, 0.70268852, 0.70269861, 0.70272207, 0.70277622]),
 'split2_test_score': array([0.71213014, 0.71213014, 0.71213014, 0.71213014, 0.71213014,
        0.71213014, 0.71213014, 0.71213014, 0.71213013, 0.71213012,
        0.7121301 , 0.71213004, 0.71212992, 0.71212961, 0.71212891,
        0.71212726, 0.7121234 , 0.71211439, 0.71209332, 0.71204394]),
 'split3_test_score': array([0.69450563, 0.69450563, 0.69450563, 0.69450563, 0.69450563,
        0.69450563, 0.69450564, 0.69450564, 0.69450565, 0.69450567,
        0.69450571, 0.69450581, 0.69450604, 0.69450658, 0.69450784,
        0.69451079, 0.69451768, 0.69453374, 0.69457112, 0.69465772]),
 'split4_test_score': array([0.67918698, 0.67918698, 0.67918698, 0.67918698, 0.67918698,
        0.67918698, 0.67918698, 0.67918698, 0.67918697, 0.67918697,
        0.67918695, 0.67918693, 0.67918686, 0.6791867 , 0.67918633,
        0.67918546, 0.67918344, 0.6791787 , 0.67916758, 0.67914129]),
 'mean_test_score': array([0.69907203, 0.69907203, 0.69907203, 0.69907203, 0.69907203,
        0.69907203, 0.69907203, 0.69907203, 0.69907203, 0.69907203,
        0.69907204, 0.69907205, 0.69907209, 0.69907218, 0.69907237,
        0.69907284, 0.69907393, 0.69907645, 0.69908225, 0.69909539]),
 'std_test_score': array([0.01149263, 0.01149263, 0.01149263, 0.01149263, 0.01149263,
        0.01149263, 0.01149263, 0.01149263, 0.01149263, 0.01149263,
        0.01149263, 0.01149262, 0.0114926 , 0.01149257, 0.01149249,
        0.0114923 , 0.01149186, 0.01149085, 0.01148852, 0.01148327]),
 'rank_test_score': array([20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10,  9,  8,  7,  6,  5,  4,
         3,  2,  1], dtype=int32)}

In [193]:
ridge_gs.best_estimator_

Ridge(alpha=10.0)

In [194]:
# Q24.3 Number of neighbours for the knn

In [ ]:
cv = KFold(n_splits=5, shuffle=True, random_state=7)

clf_neigh = KNeighborsRegressor()

grid = {
    'n_neighbors': range(3, 30, 2)
}

neigh_gs = GridSearchCV(clf_neigh, param_grid=grid, cv=cv)
neigh_gs.fit(X_train, y_train)

In [ ]:
neigh_gs.cv_results_

In [ ]:
neigh_gs.best_estimator_

In [ ]:
# Compute train and test mean squared error for your best models (list of float).

# Q25.1 Train, test MSE using linear regression with l2 regularization
# Q25.2 Train, test MSE using decision tree regression
# Q25.3 Train, test MSE using k nearest neighbours regression

In [ ]:
# Q25.1 Train, test MSE using linear regression with l2 regularization

In [ ]:
best_ridge = Ridge(alpha=10)
best_ridge.fit(X_train, y_train)

best_ridge_pred_train = best_ridge.predict(X_train)
best_ridge_pred_test = best_ridge.predict(X_test)

print('Train MSE, best ridge regression', mean_squared_error(y_train, best_ridge_pred_train))
print('Test MSE, best ridge regression', mean_squared_error(y_test, best_ridge_pred_test))

In [ ]:
# Q25.3 Train, test MSE using k nearest neighbours regression

In [ ]:
best_neigh = KNeighborsRegressor(n_neighbors=7)
best_neigh.fit(X_train, y_train)

best_neigh_pred_train = best_neigh.predict(X_train)
best_neigh_pred_test = best_neigh.predict(X_test)

print('Train MSE, best KNN', mean_squared_error(y_train, best_neigh_pred_train))
print('Test MSE, best KNN', mean_squared_error(y_test, best_neigh_pred_test))

In [ ]:
# Compute train and test R^2 for your best models (list of float).

# Q26.1 Train, test R^2 using linear regression with l2 regularization
# Q26.2 Train, test R^2 using decision tree regression
# Q26.3 Train, test R^2 using k nearest neighbours regression

In [ ]:
# Q26.1 Train, test R^2 using linear regression with l2 regularization

In [ ]:
print('Train R2, best ridge regression', best_ridge.score(X_train, y_train))
print('Test R2, best ridge regression', best_ridge.score(X_test, y_test))

In [ ]:
# Q26.3 Train, test R^2 using k nearest neighbours regression

In [ ]:
print('Train R2, best KNN', best_neigh.score(X_train, y_train))
print('Test R2, best KNN', best_neigh.score(X_test, y_test))

In [ ]:
# Q27 Which features have largest (by absolute value) weight in your linear model (top 5 features)? (list of str).

In [ ]:
overfitted_features = X.columns.tolist()
overfitted_weights = map(abs, best_ridge.coef_[0].tolist())

pd.DataFrame({'features': overfitted_features, 'weights': overfitted_weights}).sort_values(by=['weights'], ascending=False).head(5).sort_values(by=['features'])

# Make sure your .ipynb is linearly executable 
# Kernel -> Restart & Run All -> No ERROR cells

In [ ]:
# Q28 Save your .ipynb file: Name_Surname_HA1.ipynb, you will be asked to upload it into the google form.